;XCOM 2 relies on per-object config settings like the one below to link X2DataTemplate objects with their associated localized text

[SawedOff_SA_Shotgun_CV X2WeaponTemplate]
FriendlyName="Sawed-off Shotgun (T1)"
FriendlyNamePlural="Sawed-off Shotguns"
BriefSummary="An alternative to pistols, XCOM Sharpshooters can opt to carry sawed-off shotguns. Though not as deadly as a standard shotgun with the proper training these weapons can still be devestating, especially when used at close range."
TacticalText="<Bullet/> The product of field modifications by XCOM operatives sawed-off shotguns often vary in performance and reliability.\n<Bullet/> Sawed-off shotguns can be much more than a sidearm in the hands of a trained Sharpshooter.\n<Bullet/> Unlike the sniper rifle, sawed-off shotguns can be fired with a single action.\n<Bullet/> Sharpshooters can train several abilities that dramatically enhance their use of sawed-off shotguns."

[SawedOff_SA_Shotgun_MG X2WeaponTemplate]
FriendlyName="Sawed-off Shotgun (T2)"
FriendlyNamePlural="Sawed-off Shotguns"
BriefSummary="An alternative to pistols, XCOM Sharpshooters can opt to carry sawed-off shotguns. Though not as deadly as a standard shotgun with the proper training these weapons can still be devestating, especially when used at close range."
TacticalText="<Bullet/> Built from standardized blueprints and higher quality salvage these sawed-off shotguns far surpass its predecessors.\n<Bullet/> pistols are substantially more effective than their conventional precursors.\n<Bullet/> Unlike the sniper rifle, sawed-off shotguns can be fired with a single action."

[SawedOff_SA_Shotgun_BM X2WeaponTemplate]
FriendlyName="Sawed-off Shotgun (T3)"
FriendlyNamePlural="Sawed-off Shotguns"
BriefSummary="An alternative to pistols, XCOM Sharpshooters can opt to carry sawed-off shotguns. Though not as deadly as a standard shotgun with the proper training these weapons can still be devestating, especially when used at close range."
TacticalText="<Bullet/> Machine crafted to exacting standards these sawed-off shotguns are the best XCOM has available.\n<Bullet/> Unlike the sniper rifle, sawed-off shotguns can be fired with a single action."
